Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/eth97j60.c
/******************************************************************************
 * Function:        void MACPutArray(BYTE *val, WORD len)
 *
 * PreCondition:    EWRPT must point to the location to begin writing.
 *
 * Input:           *val: Pointer to source of bytes to copy.
 *					len:  Number of bytes to write to the data buffer.
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACPutArray writes several sequential bytes to the
 *					Ethernet buffer RAM.  It performs faster than multiple MACPut()
 *					calls.  EWRPT is incremented by len.
 *
 * Note:            None
 *****************************************************************************/
void MACPutArray(uint8_t *val, uint16_t len)
{
    while(len--)
	{
		// Note:  Due to a PIC18F97J60 bug, you must use the MOVFF instruction to
		// write to EDATA or else the read pointer (ERDPT) will inadvertently
		// increment.
		PRODL = *val++;
		#if defined(__XC8)
			asm("movff	_PRODL, EDATA");
			//_asm movff	PRODL, EDATA _endasm;
        #endif
		/*#if defined(HI_TECH_C)
			asm("movff	_PRODL, _EDATA");
		#else
			_asm movff	PRODL, EDATA _endasm
		#endif*/
	}
}//end MACPutArray

void MACPutROMArray(ROM uint8_t *val, uint16_t len)
{
    while(len--)
	{
		// Note:  Due to a PIC18F97J60 bug, you must use the MOVFF instruction to
		// write to EDATA or else the read pointer (ERDPT) will inadvertently
		// increment.
		PRODL = *val++;
		#if defined(__XC8)
			asm("movff	_PRODL, EDATA");
        #endif
		/*
        #if defined(HI_TECH_C)
			asm("movff	_PRODL, _EDATA");
		#else
			_asm movff	PRODL, EDATA _endasm
		#endif
        */
	}
}//end MACPutROMArray


/******************************************************************************
 * Function:        ReadPHYReg
 *
 * PreCondition:    Ethernet module must be enabled (ECON1.ETHEN = 1).
 *
 * Input:           Address of the PHY register to read from.
 *
 * Output:          16 bits of data read from the PHY register.
 *
 * Side Effects:    None
 *
 * Overview:        ReadPHYReg performs an MII read operation.  While in
 *					progress, it simply polls the MII BUSY bit wasting time
 *					(10.24us).
 *
 * Note:            None
 *****************************************************************************/
PHYREG ReadPHYReg(uint8_t Register)
{
	PHYREG Result;

	// Set the right address and start the register read operation
    MIREGADR = Register; Nop();
    MICMD = MICMD_MIIRD; Nop();

	// Loop to wait until the PHY register has been read through the MII
	// This requires 10.24us
    while(MISTATbits.BUSY);

	// Stop reading
    MICMD = 0x00; Nop();

	// Obtain results and return
    Result.VAL.v[0] = MIRDL;
    Nop();
    Result.VAL.v[1] = MIRDH;

	return Result;
}//end ReadPHYReg


/******************************************************************************
 * Function:        WritePHYReg
 *
 * PreCondition:    Ethernet module must be enabled (ECON1.ETHEN = 1).
 *
 * Input:           Address of the PHY register to write to.
 *					16 bits of data to write to PHY register.
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        WritePHYReg performs an MII write operation.  While in
 *					progress, it simply polls the MII BUSY bit wasting time
 *					(10.24us).
 *
 * Note:            None
 *****************************************************************************/
void WritePHYReg(uint8_t Register, uint16_t Data)
{
	uint8_t GIESave;

	// Write the register address
	MIREGADR = Register;

	// Write the data through the MIIM interface
	// Order is important: write low byte first, high byte last
	//
	// Due to a silicon problem, you cannot access any register with LSb address
	// bits of 0x16 between your write to MIWRL and MIWRH or else the value in
	// MIWRL will be corrupted.  This inline assembly prevents this by copying
	// the value to PRODH:PRODL first, which is at fixed locations of
	// 0xFF4:0xFF3.  These addresses have LSb address bits of 0x14 and 0x13.
	// Interrupts must be disabled to prevent arbitrary ISR code from accessing
	// memory with LSb bits of 0x16 and corrupting the MIWRL value.
	PRODL = ((TCPIP_UINT16_VAL*)&Data)->v[0];
	PRODH = ((TCPIP_UINT16_VAL*)&Data)->v[1];
	GIESave = INTCON & 0xC0;		// Save GIEH and GIEL bits
	INTCON &= 0x3F;					// Clear INTCONbits.GIEH and INTCONbits.GIEL
    #if defined(__XC8)
		asm("movff	_PRODL, 0xEB6");	// movff PRODL, MIWRL
		asm("nop");
		asm("movff	_PRODH, 0xEB7");	// movff PRODH, MIWRH
    #endif
	/*
    #if defined(HI_TECH_C)
		asm("movff	_PRODL, 0xEB6");	// movff PRODL, MIWRL
		asm("nop");
		asm("movff	_PRODH, 0xEB7");	// movff PRODH, MIWRH
	#else
		_asm
		movff	PRODL, MIWRL
		nop
		movff	PRODH, MIWRH
		_endasm
	#endif*/
	INTCON |= GIESave;				// Restore GIEH and GIEL value

	// Wait until the PHY register has been written
	// This operation requires 10.24us
    while(MISTATbits.BUSY);
}//end WritePHYReg


/******************************************************************************
 * Function:        void MACPowerDown(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACPowerDown disables the Ethernet module.
 *					All MAC and PHY registers should not be accessed.
 *
 * Note:            Normally, this function would be called before putting the
 *					PIC to sleep.  If a packet is being transmitted while this
 *					function is called, this function will block until it is
 *					it complete. If anything is being received, it will be
 *					completed.
 *
 *					The Ethernet module will continue to draw significant
 *					power in sleep mode if this function is not called first.
 *****************************************************************************/
void MACPowerDown(void)
{
	// Disable packet reception
	ECON1bits.RXEN = 0;

	// Make sure any last packet which was in-progress when RXEN was cleared
	// is completed
	while(ESTATbits.RXBUSY);

	// If a packet is being transmitted, wait for it to finish
	while(ECON1bits.TXRTS);

